Revit 2027 API
ParameterTypeId.SpliceByRulesMaxLength Property
 "Maximum bar length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SpliceByRulesMaxLength { get; }
Public Shared ReadOnly Property SpliceByRulesMaxLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SpliceByRulesMaxLength {
	ForgeTypeId^ get ();
}
static member SpliceByRulesMaxLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace